//IBMUSERC JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(10),REGION=144M,COND=(16,LT)
//*
//RUN EXEC PGM=IDISCBL1
//STEPLIB DD DSN=TEST.ZAPPBUIL.LOAD,DISP=SHR
//*        DD DISP=SHR,DSN=ISM400.SEQAMOD       Debugg
//SYSPRINT DD SYSOUT=*

